spec/fixtures/vcr_cassettes/cancels_the_order.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.6
      Authorization:
      - Bearer sk_test_T8puD64drEHANGnje2UL9BhA
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.6","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        Shabans-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 404
      message: Not Found
    headers:
      Server:
      - nginx
      Date:
      - Sun, 08 Dec 2013 20:43:13 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '204'
      Connection:
      - keep-alive
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "type": "invalid_request_error",
            "message": "Unrecognized request URL (GET: /v1/charges/).  Please see https://stripe.com/docs or we can help at https://support.stripe.com/."
          }
        }
    http_version: 
  recorded_at: Sun, 08 Dec 2013 20:43:13 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/cchhcch
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.6
      Authorization:
      - Bearer sk_test_T8puD64drEHANGnje2UL9BhA
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.6","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        Shabans-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 404
      message: Not Found
    headers:
      Server:
      - nginx
      Date:
      - Sun, 08 Dec 2013 20:48:51 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '118'
      Connection:
      - keep-alive
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "type": "invalid_request_error",
            "message": "No such charge: cchhcch",
            "param": "id"
          }
        }
    http_version: 
  recorded_at: Sun, 08 Dec 2013 20:48:52 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_3HQaKikkE9K8Ez
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.6
      Authorization:
      - Bearer sk_test_T8puD64drEHANGnje2UL9BhA
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.6","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        Shabans-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 09 Jan 2014 22:56:54 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '969'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_3HQaKikkE9K8Ez",
          "object": "charge",
          "created": 1389308212,
          "livemode": false,
          "paid": true,
          "amount": 9999,
          "currency": "gbp",
          "refunded": false,
          "card": {
            "id": "card_3HQHG90X6FRT4L",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 12,
            "exp_year": 2020,
            "fingerprint": "Sxgp5ZzwBMChDWg7",
            "customer": "cus_3HQH6GcGRXNWXi",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": null,
            "address_line1_check": null,
            "address_zip_check": null
          },
          "captured": true,
          "refunds": [],
          "balance_transaction": "txn_3HQahrwvOSzEYT",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_3HQH6GcGRXNWXi",
          "invoice": null,
          "description": null,
          "dispute": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Thu, 09 Jan 2014 22:56:54 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges/ch_3HQaKikkE9K8Ez/refund
    body:
      encoding: ASCII-8BIT
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.6
      Authorization:
      - Bearer sk_test_T8puD64drEHANGnje2UL9BhA
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.6","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        Shabans-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '0'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 09 Jan 2014 22:56:55 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1138'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_3HQaKikkE9K8Ez",
          "object": "charge",
          "created": 1389308212,
          "livemode": false,
          "paid": true,
          "amount": 9999,
          "currency": "gbp",
          "refunded": true,
          "card": {
            "id": "card_3HQHG90X6FRT4L",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 12,
            "exp_year": 2020,
            "fingerprint": "Sxgp5ZzwBMChDWg7",
            "customer": "cus_3HQH6GcGRXNWXi",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": null,
            "address_line1_check": null,
            "address_zip_check": null
          },
          "captured": true,
          "refunds": [
            {
              "amount": 9999,
              "currency": "gbp",
              "created": 1389308215,
              "object": "refund",
              "balance_transaction": "txn_3HQasaw5jx1LW7"
            }
          ],
          "balance_transaction": "txn_3HQahrwvOSzEYT",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 9999,
          "customer": "cus_3HQH6GcGRXNWXi",
          "invoice": null,
          "description": null,
          "dispute": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Thu, 09 Jan 2014 22:56:56 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: customer=cus_3HQH6GcGRXNWXi&amount=9999&currency=gbp
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.6
      Authorization:
      - Bearer sk_test_T8puD64drEHANGnje2UL9BhA
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.6","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        Shabans-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '52'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 09 Jan 2014 22:57:29 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '969'
      Connection:
      - keep-alive
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_3HQbbztZ4fyvkX",
          "object": "charge",
          "created": 1389308249,
          "livemode": false,
          "paid": true,
          "amount": 9999,
          "currency": "gbp",
          "refunded": false,
          "card": {
            "id": "card_3HQHG90X6FRT4L",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 12,
            "exp_year": 2020,
            "fingerprint": "Sxgp5ZzwBMChDWg7",
            "customer": "cus_3HQH6GcGRXNWXi",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": null,
            "address_line1_check": null,
            "address_zip_check": null
          },
          "captured": true,
          "refunds": [],
          "balance_transaction": "txn_3HQbkY5FzTuZoJ",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_3HQH6GcGRXNWXi",
          "invoice": null,
          "description": null,
          "dispute": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Thu, 09 Jan 2014 22:57:29 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_3HQbbztZ4fyvkX
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.6
      Authorization:
      - Bearer sk_test_T8puD64drEHANGnje2UL9BhA
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.6","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        Shabans-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 09 Jan 2014 22:57:30 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '969'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_3HQbbztZ4fyvkX",
          "object": "charge",
          "created": 1389308249,
          "livemode": false,
          "paid": true,
          "amount": 9999,
          "currency": "gbp",
          "refunded": false,
          "card": {
            "id": "card_3HQHG90X6FRT4L",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 12,
            "exp_year": 2020,
            "fingerprint": "Sxgp5ZzwBMChDWg7",
            "customer": "cus_3HQH6GcGRXNWXi",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": null,
            "address_line1_check": null,
            "address_zip_check": null
          },
          "captured": true,
          "refunds": [],
          "balance_transaction": "txn_3HQbkY5FzTuZoJ",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_3HQH6GcGRXNWXi",
          "invoice": null,
          "description": null,
          "dispute": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Thu, 09 Jan 2014 22:57:30 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges/ch_3HQbbztZ4fyvkX/refund
    body:
      encoding: ASCII-8BIT
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.6
      Authorization:
      - Bearer sk_test_T8puD64drEHANGnje2UL9BhA
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.6","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        Shabans-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '0'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 09 Jan 2014 22:57:32 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1138'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_3HQbbztZ4fyvkX",
          "object": "charge",
          "created": 1389308249,
          "livemode": false,
          "paid": true,
          "amount": 9999,
          "currency": "gbp",
          "refunded": true,
          "card": {
            "id": "card_3HQHG90X6FRT4L",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 12,
            "exp_year": 2020,
            "fingerprint": "Sxgp5ZzwBMChDWg7",
            "customer": "cus_3HQH6GcGRXNWXi",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": null,
            "address_line1_check": null,
            "address_zip_check": null
          },
          "captured": true,
          "refunds": [
            {
              "amount": 9999,
              "currency": "gbp",
              "created": 1389308251,
              "object": "refund",
              "balance_transaction": "txn_3HQb7Y7yXHc506"
            }
          ],
          "balance_transaction": "txn_3HQbkY5FzTuZoJ",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 9999,
          "customer": "cus_3HQH6GcGRXNWXi",
          "invoice": null,
          "description": null,
          "dispute": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Thu, 09 Jan 2014 22:57:32 GMT
recorded_with: VCR 2.8.0
