spec/fixtures/vcr_cassettes/charges_customers_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: customer=cus_34tHsCOYegeEw7&amount=9999&currency=gbp
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.6
      Authorization:
      - Bearer sk_test_T8puD64drEHANGnje2UL9BhA
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.6","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        Shabans-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '52'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 07 Dec 2013 17:01:19 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '969'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_34yOY6YsfaRqqW",
          "object": "charge",
          "created": 1386435679,
          "livemode": false,
          "paid": true,
          "amount": 9999,
          "currency": "gbp",
          "refunded": false,
          "card": {
            "id": "card_34tHPsE65uzZe6",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 12,
            "exp_year": 2020,
            "fingerprint": "Sxgp5ZzwBMChDWg7",
            "customer": "cus_34tHsCOYegeEw7",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": null,
            "address_line1_check": null,
            "address_zip_check": null
          },
          "captured": true,
          "refunds": [],
          "balance_transaction": "txn_34yOZNL4kRHhbZ",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_34tHsCOYegeEw7",
          "invoice": null,
          "description": null,
          "dispute": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Sat, 07 Dec 2013 17:01:19 GMT
recorded_with: VCR 2.8.0
